app/controllers/auteurs_controller.rb

SELECT "auteurs".* FROM "auteurs"
---
  def index
    @auteurs = Auteur.all

SELECT "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @auteur = Auteur.find(params[:id])

SELECT "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @auteur = Auteur.find(params[:id])

INSERT INTO "auteurs" ("created_at", "nom", "prenom", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 06 Jan 2013 15:48:34 UTC +00:00], ["nom", "dsd"], ["prenom", "dsdsd"], ["updated_at", Sun, 06 Jan 2013 15:48:34 UTC +00:00]]
---
  def create
    @auteur = Auteur.new(params[:auteur])

    respond_to do |format|
      if @auteur.save