app/controllers/auteur_controller.rb

  def show
  	@auteur =Auteur.find(params[:id])
---
SELECT "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT 1  [["id", "1"]]